{
  "hero_content": "I am a Java Backend Developer with a passion for mastering backend systems and architecture. With a focus on delivering efficient, scalable, and maintainable applications, I am committed to building high-quality solutions that drive performance and reliability. My expertise spans Java and key backend technologies, and I continually strive for improvement through hands-on learning and professional development. As I work to become an expert in the field, I aim to contribute meaningfully to impactful, challenging projects.",
  "hero_title": "Java Backend Developer",
  "about_text": "As a Java Backend Developer, I specialize in crafting robust, scalable, and high-performance applications using Java and related technologies. My career journey began with an intense curiosity about system architecture, which evolved into a focus on backend development. With hands-on experience in Java, Spring, and database technologies, I thrive in solving complex problems and optimizing system performance. I believe in continuous learning and actively seek opportunities to grow my skill set. Outside of development, I’m passionate about sports, particularly weighted Calisthenics, where I focus on pushing my limits and balancing personal well-being with productivity.",
  "about-me-title-1": "About",
  "about-me-title-2": " Me",
  "technologies-title": "Technologies",
  "experiences-title": "Experience",
  "projects-title": "Projects",
  "contacts-title": "Contact",
  "experiences": [
    {
      "year": "2024 - Present",
      "role": "Junior Java Backend Developer",
      "company": {
        "name": "nexnet GmbH",
        "link": "https://www.nexnet.de/"
      },
      "description": "As a Junior Java Backend Developer, I design and develop Java-based backend applications using Spring Boot. I focus on building and integrating RESTful APIs, performing unit and integration tests to ensure high code quality, and collaborating in agile teams. Additionally, I conduct code reviews to ensure maintainability and adherence to best practices.",
      "technologies": ["Java", "Spring Boot", "SQL", "Maven", "Git", "Docker", "Postman", "Bamboo"]
    },
    {
      "year": "2021 - 2024",
      "role": "Apprenticeship as a Software Developer",
      "company": {
        "name": "nexnet GmbH",
        "link": "https://www.nexnet.de/"
      },
      "description": "In my apprenticeship, I gained extensive experience in Java, Spring, and SQL, while working with modern development tools like Maven, Git, Docker, and Postman. I contributed to both backend and frontend projects, focused on writing unit tests (JUnit), applied security concepts, and developed UI/UX with a strong foundation in project management methodologies.",
      "technologies": ["Java", "Spring", "Maven", "SQL", "Hibernate", "JasperReports", "Docker", "Git", "Postman", "Bamboo"]
    },
    {
      "year": "2019 - 2021",
      "role": "Embedded Systems (B.Eng.)",
      "company": {
        "name": "Berliner Hochschule für Technik",
        "link": "https://www.bht-berlin.de/"
      },
      "description": "This experience was key in shaping my decision to pursue a career in programming. It provided me with a deep understanding of programming principles, starting with C, and helped me develop a solid foundation in both embedded systems and general software development.",
      "technologies": ["C", "Digital Systems"]
    },
    {
      "year": "2016 - 2019",
      "role": "State-certified Electrical Engineering Assistant (Focus on Electronics and Data Technology)",
      "company": {
        "name": "Hein-Moeller-Schule",
        "link": "https://www.hein-moeller-schule.de/"
      },
      "description": "My journey in programming began here, where I worked with C++, HTML, CSS, SQL, and PHP. I explored web development by creating a website for a fictitious startup and delved into SQL and PHP for backend development. I also gained hands-on experience with Linux, setting up file access through the command line and exploring distribution systems.",
      "technologies": ["HTML", "CSS", "SQL", "PHP", "C++", "Linux"]
    }
  ],
  "projects": [
    {
      "title": "Portfolio Website",
      "image": "https://raw.githubusercontent.com/Michael-Vardanyan/image-host/main/images/portfolio-project-images/portfolio-website.png",
      "link": "https://bymichael.dev",
      "description": "A personal portfolio website that showcasing my projects, skills, and contact information.",
      "technologies": ["Vite", "React", "Tailwind CSS"]
    },
    {
      "title": "URL Shortener",
      "image": "https://raw.githubusercontent.com/Michael-Vardanyan/image-host/main/images/portfolio-project-images/url-shortener.png",
      "link": "https://url-shortener.bymichael.dev",
      "description": "A URL shortening application where users can shorten links and track usage.",
      "technologies": ["HTML", "CSS", "JavaScript"]
    },
    {
      "title": "Dog Glossary",
      "image": "https://raw.githubusercontent.com/Michael-Vardanyan/image-host/main/images/portfolio-project-images/dog-glossary.png",
      "link": "https://dog-glossary.bymichael.dev",
      "description": "An interactive app to browse dog breeds A-Z with detailed descriptions and images.",
      "technologies": ["HTML", "CSS", "JavaScript"]
    },
    {
      "title": "To-Do List",
      "image": "https://raw.githubusercontent.com/Michael-Vardanyan/image-host/main/images/portfolio-project-images/todo-list.png",
      "link": "https://todo-list.bymichael.dev",
      "description": "A fully functional to-do list app with task creation and management features.",
      "technologies": ["HTML", "CSS", "JavaScript"]
    }
  ],
  "contact": {
    "message": "Get in Touch With Me",
    "address": "Berlin, Germany",
    "email": "hello@bymichael.dev"
  }
}
